"""Как вы знаете, в языке Python для
создания комментариев в коде используется символ #.
Комментарий начинается с этого символа и продолжается
до конца строки – без возможности остановить его раньше.
В данном упражнении вам предстоит написать программу,
которая будет удалять все комментарии из исходного
файла с кодом на языке Python. Пройдите по всем строкам
в файле на предмет поиска символа #. Обнаружив его,
программа должна удалить все содержимое, начиная с этого
символа и до конца строки. Для простоты не будем
рассматривать ситуации, когда знак решетки встречается
в середине строки. Сохраните новое содержимое в созданном
файле. Имена файла источника и файла назначения должны
быть запрошены у пользователя. Удостоверьтесь в том, что
программа корректно
обрабатывает возможные ошибки при работе с обоими файлами."""

copy_text = []
first = []
with open("345.txt", encoding="utf8") as f:
    data = [line for line in f]  # запись кода в список
    for a in data:
        if "#" in a:
            result = a.index("#")  # нашли индекс решетки
            first_chars = a[:result] + "\n"  # обрезать решетку
            copy_text.append(first_chars)



        else:
            copy_text.append(a)
print(copy_text)

with open("text2.txt", "w", encoding="utf8") as f:
    for line in copy_text:
        f.write(line)
